Repository: pepr/progit2-cs
Catalog: omegat/tm/auto/progit-omegat-asciidoc.tmx
Source language: en
Languages: cs

source: This is most useful if you’re working with a person consistently.
cs: Tuto možnost využijete zejména tehdy, když s někým spolupracujete dlouhodobě.

source: This is much like specifying `git diff --cached` on the command line:
cs: Je to prakticky totéž, jako byste na příkazovém řádku zadali příkaz `git diff --cached`:

source: This is necessary because Git does its own filename expansion in addition to your shell’s filename expansion.
cs: Je tu proto, že Git provádí své vlastní nahrazování masek souborů nad to, které provádí váš shell.

source: This is nice because with this syntax you can specify more than two references in your query, which you cannot do with the double-dot syntax.
cs: Tato syntaxe je užitečná zejména proto, že pomocí ní můžete zadat více než dvě reference, což není pomocí dvojtečkové syntaxe možné.

source: This is nice if you have a number of patches saved, because you can view the patch first if you don’t remember what it is, or not apply the patch if you’ve already done so.
cs: To oceníte v situaci, kdy máte uložených několik záplat. Pokud si nepamatujete, o co v dané záplatě šlo, můžete si ho před aplikací prohlédnout. Stejně tak vyloučíte záplaty, které jste už jednou aplikovali.

source: This is often called a pull request, and you can either generate it via the website — GitHub has a "pull request" button that automatically messages the maintainer — or run the `git request-pull` command and e-mail the output to the project maintainer manually.
cs: Tomu se říká „žádost o natažení“ (angl. pull request). Můžete ji vygenerovat buď na webové stránce – server GitHub má tlačítko „pull request“, které automaticky odešle správci upozornění – nebo můžete zadat příkaz `git request-pull` a jeho výstup e-mailem ručně odeslat správci projektu.

source: This is often used if everyone on your team has access to a shared filesystem such as an NFS mount, or in the less likely case that everyone logs in to the same computer.
cs: Často se využívá v případech, kdy mají všichni z vašeho týmu přístup k vašim sdíleným souborům, např. přes připojení systému NFS, nebo – v méně pravděpodobném případě – se všichni přihlašují na jednom počítači.

source: This is one of the few areas in Git where you may lose some work if you do it wrong.
cs: Je to jedna z mála oblastí v systému Git, kdy při neuváženém postupu riskujete, že přijdete o část své práce.

source: This is particularly useful for managing your branches — if you have a lot of branches, you can use range specifications to answer questions such as, "What work is on this branch that I haven’t yet merged into my main branch?"
cs: To využijete zejména při správě větví. Máte-li větší množství větví, pomůže vám označení intervalu revizí dohledat odpovědi na otázky typu: „Jaká práce je obsažena v této větvi, kterou jsem ještě nezačlenil do hlavní větve?“

source: This is particularly useful if you forgot to add something to your `.gitignore` file and accidentally staged it, like a large log file or a bunch of `.a` compiled files.
cs: To může být užitečné zejména v situaci, kdy něco zapomenete přidat do souboru `.gitignore`, a omylem to tak zahrnete do revize, např. velký log soubor nebo pár zkompilovaných souborů s příponou `.a`.

source: This is really useful.
cs: Tato funkce je opravdu užitečná.

source: This is referred to as a merge commit and is special in that it has more than one parent.
cs: Takové revizi se říká revize sloučením (merge commit) a její zvláštností je to, že má více než jednoho rodiče.

source: This is roughly equivalent to something like
cs: Je to přibližně stejné, jako byste zadali například:

source: This is roughly the same script as the server-side part, but with two important differences.
cs: Jedná se o přibližně stejný skript, jaký funguje na serveru, avšak se dvěma podstatnými rozdíly.

source: This is shorthand for:
cs: Tímto způsobem jste spojili dva příkazy:

source: This is something you’ve likely never done with a VCS before because it’s generally too expensive to create and merge branches.
cs: Je to záležitost, do které byste se v jiném systému pro správu verzí asi raději nikdy nepustili, protože vytvářet a slučovat větve je v něm opravdu složité.

source: This is the SHA-1 hash — a checksum of the content you’re storing plus a header, which you’ll learn about in a bit.
cs: Jedná se o otisk SHA-1 – kontrolní součet spojení ukládaného obsahu a záhlaví, o němž si povíme za okamžik.

source: This is the basic information that the commit object stores for you.
cs: Toto jsou základní informace, které obsahuje objekt revize.

source: This is the beginning of the output of the format-patch command that you saw in the previous section.
cs: Toto je začátek výstupu příkazu format-patch, s nímž jsme se setkali v předchozí části.

source: This is the case because the pointer you have for the submodule isn’t what is actually in the submodule directory.
cs: A tak to opravdu je, protože ukazatel, který máte pro submodul, není to, co máte skutečně v adresáři submodulu.

source: This is the main thing to remember about Git if you want the rest of your learning process to go smoothly.
cs: Pokud chcete dále hladce pokračovat ve studiu Git, budou pro vás následující informace stěžejní.

source: This is the most important part of Git, and it is what is copied when you clone a repository from another computer.
cs: Je to nejdůležitější část systému Git a zároveň adresář, který se zkopíruje, když klonujete repozitář z jiného počítače.

source: This is useful if you have a number of commits on a topic branch and you want to integrate only one of them, or if you only have one commit on a topic branch and you’d prefer to cherry-pick it rather than run rebase.
cs: To využijete například v situaci, kdy máte několik revizí v tematické větvi, ale chcete integrovat pouze jednu z nich. Částečné převzetí však můžete použít i místo přeskládání, pokud máte v tematické větvi pouze jednu revizi.

source: This is useful if you want to keep the `experiment` branch up to date and preview what you’re about to merge in.
cs: Tento log využijete, pokud chcete udržovat větev `experiment` stále aktuální a zjistit, co hodláte začlenit.

source: This is useful if you write your own tools that work with a Git repository.
cs: Tuto možnost využijete, pokud si píšete své vlastní nástroje, které fungují s repozitářem Git.

source: This is very helpful for code review or to quickly browse what happened during a series of commits that a collaborator has added.
cs: Tato funkce je velmi užitečná při kontrole kódu nebo k rychlému zjištění, co bylo obsahem série revizí, které přidal váš spolupracovník.

source: This is very similar to what `receive-pack` responds with, but the capabilities are different.
cs: Informace se nápadně podobají těm, jimiž odpovídá proces `receive-pack`, liší se však schopnosti.

source: This is where Distributed Version Control Systems (DVCSs) step in.
cs: V tomto místě přicházejí ke slovu tzv. distribuované systémy správy verzí (DVCS z angl. Distributed Version Control System).

source: This kind of workflow isn’t common but can be useful in very big projects or in highly hierarchical environments, as it allows the project leader (the dictator) to delegate much of the work and collect large subsets of code at multiple points before integrating them.
cs: Tento typ pracovního postupu není sice obvyklý, ale může být užitečný u velmi velkých projektů nebo v silně hierarchizovaných prostředích, neboť umožňuje, aby vedoucí projektu (diktátor) velkou část práce delegoval. Pak sbírá velké kusy kódu, které integruje.

source: This leads us to the three main sections of a Git project: the Git directory, the working directory, and the staging area.
cs: Z toho vyplývá, že projekt je v systému Git rozdělen do tří hlavních částí: adresář systému Git (Git directory), pracovní adresář (working directory) a oblast připravených změn (staging area).

source: This leaves four important entries: the `HEAD` and `index` files and the `objects` and `refs` directories.
cs: Zbývají čtyři důležité položky: soubory `HEAD` a `index` a adresáře `objects` a `refs`.

source: This lets the user with that key modify the main Git repository that controls the Gitosis setup.
cs: Uživatel s tímto klíčem poté bude moci měnit hlavní repozitář Git, kterým se ovládá nastavení nástroje Gitosis.

source: This lets you clone another repository into your project and keep your commits separate.
cs: Do svého projektu tak můžete naklonovat jiný repozitář a uchovávat revize oddělené.

source: This lifecycle is illustrated in Figure 2-1.
cs: Pracovní cyklus je znázorněn na obrázku 2-1.

source: This looks a bit different than the `hotfix` merge you did earlier.
cs: Toto už se trochu liší od začlenění větve `hotfix`, které jste prováděli před chvílí.

source: This makes Git more like a mini filesystem with some incredibly powerful tools built on top of it, rather than simply a VCS.
cs: Git se podobá malému systému souborů (spíše než obyčejnému VCS) s řadou skutečně výkonných nástrojů, jež jsou na něm postavené.

source: This makes for a very powerful revision query system that should help you figure out what is in your branches.
cs: Tím máte v rukou velmi efektivní systém vyhledávání revizí, který vám pomůže zjistit, co vaše větve obsahují.

source: This makes merging a heck of a lot easier in Git than in these other systems.
cs: Slučování větví je proto v systému Git o poznání jednodušší než v ostatních systémech.

source: This makes the following two commands equivalent:
cs: Po zadání takového příkazu budete mít k dispozici dva ekvivalentní příkazy:

source: This makes using Git a joy because we know we can experiment without the danger of severely screwing things up.
cs: Díky tomu vás bude práce se systémem Git bavit. Budete pracovat s vědomím, že můžete experimentovat, a neriskujete přitom nevratné zničení své práce.

source: This makes your `import` command look like this:
cs: Váš příkaz `import` pak bude mít tuto podobu:

source: This may be a bit confusing, so let’s look at an example.
cs: Mohlo by to být trochu matoucí, takže si uveďme příklad.

source: This may be an easier or more comfortable workflow for you; and by default, the `git clone` command automatically sets up your local master branch to track the remote master branch on the server you cloned from (assuming the remote has a master branch).
cs: Tento postup pro vás může být snazší a pohodlnější. Standardně přitom příkaz `git clone` automaticky nastaví vaši lokální hlavní větev, aby sledovala vzdálenou hlavní větev na serveru, z kterého jste klonovali (za předpokladu, že má vzdálený server hlavní větev).

source: This may mean moving in large binary files that you don’t want source controlled, auto-generating documentation, or something along those lines.
cs: Pod tím si můžete představit například přesouvání velkých binárních souborů, jejichž zdrojový kód si nepřejete verzovat, automatické generování dokumentace apod.

source: This may not seem like a huge deal, but you may be surprised what a big difference it can make.
cs: Možná to vypadá jako maličkost, ale divili byste se, jak velký je v tom rozdíl.

source: This means I can pull contributions from any of these users pretty easily.
cs: To znamená, že mohu velmi snadno stáhnout příspěvky od kteréhokoli z těchto uživatelů.

source: This means `master` almost always moves forward, `next` is rebased occasionally, and `pu` is rebased even more often (see Figure 5-25).
cs: To znamená, že se větev `master` téměř neustále posouvá vpřed, větev `next` je čas od času přeskládána a větev `pu` je přeskládávána ještě o něco častěji (viz obrázek 5-25).

source: This means it’s impossible to change the contents of any file or directory without Git knowing about it.
cs: Znamená to, že není možné změnit obsah jakéhokoli souboru nebo adresáře, aniž by o tom Git nevěděl.

source: This means that if two developers clone from the hub and both make changes, the first developer to push their changes back up can do so with no problems.
cs: To znamená, že pokud dva vývojáři klonují z centrálního úložiště a oba provedou změny, jen první z nich, který odešle své změny, to může provést bez komplikací.

source: This means that if you commit at this point, the `master` branch will be moved forward with your new work.
cs: Pokud tedy nyní zapíšete revizi, vaše nová práce posune vpřed větev `master`.

source: This means that there is generally no pushing over this protocol.
cs: To znamená, že se přes tento protokol nedají odesílat žádné revize.

source: This means that when you push to the server via SSH, Git will run this command to update the files needed for HTTP fetching.
cs: Znamená to, že až budete odesílat data na server prostřednictvím SSH, Git spustí tento příkaz a aktualizuje soubory vyžadované pro přístup přes HTTP.

source: This means that, for example, instead of typing `git commit`, you just need to type `git ci`.
cs: To znamená, že například místo kompletního příkazu `git commit` stačí zadat pouze zkrácené `git ci`.

source: This means the tag directly above is an annotated tag and that line is the commit that the annotated tag points to.
cs: Tento řádek znamená, že značka bezprostředně nad ním je anotovaná a tento řádek je revize, na niž tato anotovaná značka ukazuje.

source: This means the version in HEAD (your master branch, because that was what you had checked out when you ran your merge command) is the top part of that block (everything above the `=======`), while the version in your `iss53` branch looks like everything in the bottom part.
cs: To znamená, že verze ve větvi s ukazatelem HEAD (vaše hlavní větev – v té jste se nacházeli při provádění příkazu merge) je uvedena v horní části tohoto bloku (všechno nad oddělovačem `=======`), verze obsažená ve větvi `iss53` je vše, co se nachází v dolní části.

source: This means you can do local branching and merging, use the staging area, use rebasing and cherry-picking, and so on, while your collaborators continue to work in their dark and ancient ways.
cs: To znamená, že můžete vytvářet nové lokální větve a slučovat je, používat oblast připravených změn, přeskládávat, částečně přejímat atd., zatímco vaši spolupracovníci budou dále pracovat svými zašlými a prastarými způsoby.

source: This means you can have several branches that are always open and that you use for different stages of your development cycle; you can merge regularly from some of them into others.
cs: Můžete tak mít několik větví, které jsou stále otevřené a které používáte pro různé fáze vývojového cyklu. Pravidelně můžete začleňovat práci z jedné větve do ostatních.

source: This means you have a clean working directory — in other words, no tracked files are modified.
cs: To znamená, že žádné soubory nejsou připraveny k zapsání a pracovní adresář je čistý. Jinými slovy, žádné sledované soubory nebyly změněny.

source: This means you see the project history almost instantly.
cs: Znamená to, že se historie projektu zobrazí téměř hned.

source: This modifies the files in your working directory.
cs: Tím změníte soubory ve svém pracovním adresáři.

source: This moves HEAD to point to the testing branch (see Figure 3-6).
cs: Tímto příkazem přesunete ukazatel HEAD tak, že ukazuje na větev testing (viz obrázek 3-6).

source: This object type is called a blob.
cs: Tento typ objektu se nazývá blob.

source: This occurs fairly commonly.
cs: Toto je opravdu velmi častá situace.

source: This opens a vast range of workflow possibilities for your project and/or your team, so I’ll cover a few common paradigms that take advantage of this flexibility.
cs: Tím se pro váš projekt a váš tým otvírá široké spektrum pracovních postupů. Zkusíme se tedy podívat na pár častých přístupů, které tato flexibilita umožňuje.

source: This option adds a nice little ASCII graph showing your branch and merge history, which we can see in our copy of the Grit project repository:
cs: Tento parametr vloží pěkný malý ASCII graf, znázorňující historii vaší větve a slučování, kterou si ukážeme na naší kopii repozitáře projektu Grit:

source: This option changes the log output to formats other than the default.
cs: Tento parametr změní výstup logu na jiný než výchozí formát.

source: This option displays the same information but with a diff directly following each entry.
cs: Tento parametr zobrazí tytéž informace, ale za každým záznamem následuje informace o rozdílech.

source: This option is available only in Git 1.6.1 and later.
cs: Tato možnost je dostupná ve verzi systému Git 1.6.1 a novějších.

source: This option isn’t on by default because it doesn’t work if the commit the patch says it was based on isn’t in your repository.
cs: Tato možnost není nastavena jako výchozí, protože ji nelze použít v situaci, kdy revize, o níž záplata říká, že je na ní založena, není obsažena ve vašem repozitáři.

source: This process is just like sharing remote branches — you can run `git push origin [tagname]`.
cs: Tento proces je stejný jako sdílení vzdálených větví. Spusťte příkaz `git push origin [název značky]`.

source: This process is similar across all operating systems.
cs: Tento proces se napříč operačními systémy téměř neliší.

source: This prompted the Linux development community (and in particular Linus Torvalds, the creator of Linux) to develop their own tool based on some of the lessons they learned while using BitKeeper.
cs: To přimělo komunitu vývojářů Linuxu (a zejména Linuse Torvaldse, tvůrce Linuxu), aby vyvinula vlastní nástroj, založený na poznatcích, které nasbírala při užívání systému BitKeeper.

source: This pulls the same change introduced in `e43a6`, but you get a new commit SHA-1 value, because the date applied is different.
cs: Tímto natáhnete stejnou změnu, která byla provedena revizí `e43a6`, avšak hodnota SHA-1 obou revizí se bude lišit, neboť bude rozdílné datum aplikace.

source: This reduces the load on the main admin, and makes him less of a bottleneck.
cs: To snižuje vytížení hlavního administrátora, který tím přestává být úzkým místem správy.

source: This replays your `server` work on top of your `master` work, as shown in Figure 3-34.
cs: Příkaz provede změny obsažené ve větvi `server` ještě jednou na vrcholu větve `master`, jak je znázorněno na obrázku 3-34.

source: This resolution has a little of each section, and I’ve fully removed the `<<<<<<<`, `=======`, and `>>>>>>>` lines.
cs: Toto řešení obsahuje trochu z každé části a zcela jsem odstranil řádky `<<<<<<<`, `=======` a `>>>>>>>`.

source: This rewrites your history to now look like Figure 5-17.
cs: Tím přepíšete svou historii, která teď bude vypadat jako na obrázku 5-17.

source: This runs the equivalent of two commands — `git svn init` followed by `git svn fetch` — on the URL you provide.
cs: Na adrese URL, kterou jste zadali, tím v podstatě provedete dva příkazy: `git svn init` a `git svn fetch`.

source: This scenario often includes a canonical repository that represents the "official" project.
cs: Tento scénář často zahrnuje jeden standardní repozitář, který reprezentuje „oficiální“ projekt.

source: This script can’t stop the push process, but the client doesn’t disconnect until it has completed; so, be careful when you try to do anything that may take a long time.
cs: Tento skript nedokáže zastavit proces odesílání, avšak klient se neodpojí, dokud není dokončen. Buďte proto opatrní, pokud se chystáte provést akci, která může dlouho trvat.

source: This script uses a syntax that wasn’t covered in the Revision Selection section of Chapter 6.
cs: Tento skript používá syntaxi, které jsme se v části Výběr revize v kapitole 6 nevěnovali.

source: This section goes over some importers that are included with Git for common systems and then demonstrates how to develop your own custom importer.
cs: V této části se seznámíte s několika importéry pro běžné systémy, které jsou součástí systému Git, a poté ukážeme, jak si můžete vytvořit importér vlastní.

source: This section has covered a number of common workflows for dealing with several very different types of Git projects you’re likely to encounter and introduced a couple of new tools to help you manage this process.
cs: V této části jsme popsali několik obvyklých pracovních postupů při přispívání do velmi odlišných typů projektů Git, s nimiž se můžete setkat. Představili jsme k nim také nové nástroje, které vám mohou v těchto procesech pomoci.

source: This section outlines the various ways you can refer to a single commit.
cs: Tato část uvede několik různých způsobů, jak lze určit jednu konkrétní revizi.

source: This section revisits a couple of commands so you can see how you can use them to review exactly what you’ll be introducing if you merge this into your main branch.
cs: V této části zopakujeme některé příkazy a podíváme se, jak je můžete použít, chcete-li zjistit, co přesně se stane, pokud novou práci začleníte do své hlavní větve.

source: This section serves as a quick introduction to Gitolite, and provides basic installation and setup instructions.
cs: Tato podkapitola slouží k rychlému seznámení s Gitolite a uvádí základní pokyny pro instalaci a nastavení.

source: This section splits them into committing-workflow hooks, e-mail-workflow scripts, and the rest of the client-side scripts.
cs: V této části je rozdělíme na zásuvné moduly k zapisování revizí, zásuvné moduly pro práci s e-maily a na ostatní zásuvné moduly.

source: This section will cover some of these scenarios.
cs: Tato část se na některé z těchto scénářů zaměří.

source: This section will quickly cover how these two main protocols operate.
cs: Tato část se ve stručnosti zaměří na to, jak tyto dva základní protokoly fungují.

source: This seems a bit clearer.
cs: Příkaz unstage je o něco jasnější.

source: This server is at `git.team1.ourcompany.com`.
cs: Tento server se nachází na `git.team1.ourcompany.com`.

source: This sets up the properties to run the sync.
cs: Tím nastavíte vlastnosti synchronizace.

source: This setup offers many advantages, especially over local VCSs.
cs: Nabízí ostatně mnoho výhod, zejména v porovnání s lokálními systémy VCS.

source: This setup should leave you with CRLF endings in Windows checkouts but LF endings on Mac and Linux systems and in the repository.
cs: Toto nastavení by vám mělo pomoci zachovat zakončení CRLF při checkoutu v systému Windows a zakončení LF v systémech Mac a Linux a v repozitářích.

source: This shows your other branch.
cs: Nyní se zobrazila jiná větev.

source: This tab also shows a box with the latest commit information.
cs: Tato záložka obsahuje rovněž pole s informacemi o poslední zapsané revizi.

source: This takes a number of custom settings: `merge.tool` to tell Git what strategy to use, `mergetool.*.cmd` to specify how to run the command, `mergetool.trustExitCode` to tell Git if the exit code of that program indicates a successful merge resolution or not, and `diff.external` to tell Git what command to run for diffs.
cs: S tím souvisí celá řada uživatelských nastavení: `merge.tool`, jímž systému Git sdělíte, kterou strategii slučování má používat, `mergetool.*.cmd`, jímž určíte, jak příkaz spustit, `mergetool.trustExitCode`, který systému Git sdělí, zda návratový kód tohoto programu oznamuje, nebo neoznamuje úspěšné vyřešení sloučení, a `diff.external`, který systému Git říká, jakým příkazem se zjišťují rozdíly.

source: This takes all the commits you’ve made on top of the Subversion server code, does a Subversion commit for each, and then rewrites your local Git commit to include a unique identifier.
cs: Příkaz vezme všechny revize, které jste provedli na vrcholu kódu ze serveru Subversion, každou jednotlivě zapíše do systému Subversion a přepíše vaši lokální revizi Git tak, aby obsahovala unikátní identifikátor.
